Repository: python-docs-ko/PEPs-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ko

source: Modules that are designed for use via ``from M import *`` should use the ``__all__`` mechanism to prevent exporting globals, or use the older convention of prefixing such globals with an underscore (which you might want to do to indicate these globals are "module non-public").
ko: ``from M import *`` 구문을 통해 사용할 수 있도록 설계된 모듈들은 ``__all__`` 메커니즘을 사용하여 전역적으로 노출되는 것을 방지하거나, 전역 객체에 언더스코어를 붙이는 예전의 규칙을 사용해야 한다 (이들 전역 객체를 "비 public 모듈"로 표시하고 싶을 경우 사용한다).

source: Motivation
ko: 동기

source: Names to Avoid ~~~~~~~~~~~~~~
ko: 피해야 할 이름 ~~~~~~~~~~~~~~

source: Naming Conventions ==================
ko: 명명 규칙 =========

source: Naming conventions ==================
ko: 명명 관례 =========

source: Never mix tabs and spaces.
ko: 절대 탭 문자와 공백 문자를 섞어 쓰지 마라.

source: Never use the characters 'l' (lowercase letter el), 'O' (uppercase letter oh), or 'I' (uppercase letter eye) as single character variable names.
ko: 'l' (소문자 L), 'O' (대문자 O), 'I' (대문자 I) 한 글자를 변수 이름으로 사용하지 않는다.

source: New Modules
ko: 새로운 모듈

source: New features for Python 2.2
ko: 파이썬 2.2의 새로운 기능

source: No-longer-supported platforms -----------------------------
ko: 더 이상 지원하지 않는 플랫폼 ----------------------------

source: No: if type(obj) is type(1):
ko: 나쁨: if type(obj) is type(1):

source: No: import sys, os
ko: 나쁨: import sys, os

source: No: if len(seq) if not len(seq)
ko: 나쁨: if len(seq) if not len(seq)

source: No::
ko: 나쁨::

source: None.
ko: 없음.

source: Not only does this first step present the user a simpler landscape as explained in the rationale_ section, but it also allows for a better and more complete resolution of `Step 2`_ (see Prerequisite_).
ko: Not only does this first step present the user a simpler landscape as explained in the 근거_ section, but it also allows for a better and more complete resolution of `Step 2`_ (see Prerequisite_).

source: Note
ko: 참고

source: Note 1: Note that only the simple class name is used in the mangled name, so if a subclass chooses both the same class name and attribute name, you can still get name collisions.
ko: 주의 1: 맹글링에는 단순히 클래스 이름만이 쓰인다는 것에 주의하자. 그러므로 만약 자식 클래스가 동일한 클래스 이름과 어트리뷰트 이름을 사용한다면, 여전히 이름 충돌이 일어날 가능성이 있다.

source: Note 1: Properties only work on new-style classes.
ko: 주의 1: 프로퍼티는 새로운 스타일의 클래스에서만 동작한다.

source: Note 1: See the argument name recommendation above for class methods.
ko: 주의 1: 위에서 설명한 클래스 메서드의 인수 이름에 대한 권장사항을 살펴보자.

source: Note 2: Name mangling can make certain uses, such as debugging and ``__getattr__()``, less convenient. However the name mangling algorithm is well documented and easy to perform manually.
ko: 주의 2: 이름 맹글링을 사용하면 디버깅과 ``__getattr__()`` 등의 작업이 조금 불편해진다. 하지만, 네임 맹글링 알고리즘에 대해서는 이미 정리가 잘 되어 있으므로 직접 필요한 작업을 처리하는 것도 어렵지 않다.

source: Note 2: Try to keep the functional behavior side-effect free, although side-effects such as caching are generally fine.
ko: 주의 2: 기능적 동작에 있어 부작용이 생기지 않도록 주의한다. 하지만 캐시처럼 부작용이 주 기능인 경우는 일반적으로 괜찮다.

source: Note 3: Avoid using properties for computationally expensive operations; the attribute notation makes the caller believe that access is (relatively) cheap.
ko: 주의 3: 큰 계산량을 요구하는 프로퍼티의 사용은 피한다. 호출자는 어트리뷰트에 대한 접근 비용이 (비교적) 적다고 기대하게 된다.

source: Note 3: Not everyone likes name mangling. Try to balance the need to avoid accidental name clashes with potential use by advanced callers.
ko: 주의 3: 모든 이가 네임 맹글링을 좋아하는 것은 아니다. 우발적인 이름 충돌의 방지와, 해당 클래스를 사용하게 될 사람의 편의성 사이에서 형평성을 찾도록 하자.

source: Note, rules are there to be broken. Two good reasons to break a particular rule:
ko: 규칙은 깨지기 위해 존재한다. 특정한 규칙을 무시해도 괜찮은 두 가지 경우를 살펴보자.

source: Note: When using abbreviations in CapWords, capitalize all the letters of the abbreviation. Thus HTTPServerError is better than HttpServerError. - ``mixedCase`` (differs from CapitalizedWords by initial lowercase character!) - ``Capitalized_Words_With_Underscores`` (ugly!)
ko: 주의: CapWords에서 약어를 사용할 경우, 약어의 모든 글자를 대문자로 기술한다. 그러므로 HTTPServerError가 HttpServerError를 사용하는 것 보다 낫다. - ``mixedCase`` (CapWords와 다른 점은 첫 글자가 소문자라는 것이다) - ``Capitalized_Words_With_Underscores`` (이건 별로다!)

source: Note: there is some controversy about the use of __names (see below).
ko: 주의: __names의 사용에 대해서는 다소 논란이 있다 (아래 내용을 참조).

source: Notes:
ko: 참고:

source: Notice
ko: 알림

source: Older versions are available as:
ko: 오래된 버전은 아래에 있다.

source: Once a PEP has been accepted, the reference implementation must be completed. When the reference implementation is complete and incorporated into the main source code repository, the status will be changed to "Final".
ko: 일단 PEP가 수용되면, 참조 구현을 반드시 완료하여야 한다. 참조 구현이 완료되어 주 소스 코드 저장소에 통합되면, 상태가 "최종(Final)"으로 변경된다.

source: Once the PEP is ready for the repository, a PEP editor will:
ko: PEP가 저장소에 들어갈 준비를 갖추었으면, PEP 편집자는 다음과 같은 일을 한다.

source: Once the authors have completed a PEP, they may request a review for style and consistency from the PEP editors. However, the content and final acceptance of the PEP must be requested of the BDFL, usually via an email to the python-dev mailing list. PEPs are reviewed by the BDFL and his chosen consultants, who may accept or reject a PEP or send it back to the author(s) for revision. For a PEP that is predetermined to be acceptable (e.g., it is an obvious win as-is and/or its implementation has already been checked in) the BDFL may also initiate a PEP review, first notifying the PEP author(s) and giving them a chance to make revisions.
ko: 저자가 PEP를 완료하면, PEP 편집자에게 형식과 일관성에 대해 검토를 요청할 수 있다. 그러나, PEP의 내용과 최종 수용은 BDFL에게 요청하여야 하며, 보통 python-dev 메일링 리스트에 이메일을 보냄으로써 이루어진다. BDFL과 그가 선택한 컨설턴트들이 PEP를 검토하여, PEP를 승인 또는 기각하거나 개정을 위해 저자에게 반송한다. 수용이 이미 정해진 PEP(명백한 것 및 구현이 이미 체크인 된 것 등)에 대해서도 BDFL이 PEP 검토에 착수하고 PEP 저자에게 알림으로써 개정의 기회를 부여할 수 있다.

source: Once the champion has asked the Python community as to whether an idea has any chance of acceptance, a draft PEP should be presented to python-ideas. This gives the author a chance to flesh out the draft PEP to make properly formatted, of high quality, and to address initial concerns about the proposal.
ko: 챔피언이 파이썬 커뮤니티에 질문하여 아이디어가 받아들여질 가능성이 있다고 판단되면, 아이디어를 나타낸 PEP를 작성한다. 저자에게는 적합한 형식과 높은 품질을 갖추고 제안의 주된 관심사를 적시할 기회가 주어진다.

source: One of Guido's key insights is that code is read much more often than it is written. The guidelines provided here are intended to improve the readability of code and make it consistent across the wide spectrum of Python code. As PEP 20 says, "Readability counts".
ko: 귀도의 중요한 통찰 중 하나는 프로그램 코드가 작성되는 횟수보다는 사람에게 읽히는 횟수가 더 많다는 사실이다. 이 문서에서 제공하는 가이드라인은 코드의 가독성을 향상시키고 다양한 파이썬 코드에 일관성을 부여하고자하는 의도를 갖고 있다. PEP 20에서 언급하듯, "가독성은 중요하다."

source: Open Issues
ko: 진행 중인 사항

source: Open source projects with a global audience are encouraged to adopt a similar policy.
ko: 전세계인이 참여 중인 오픈 소스 프로젝트들은 이와 비슷한 정책을 따르도록 하고 있다.

source: Optional::
ko: 선택사항::

source: Other Recommendations ---------------------
ko: 기타 권고사항 -------------

source: PEP 207 indicates that reflexivity rules *are* assumed by Python. Thus, the interpreter may swap ``y > x`` with ``x < y``, ``y >= x`` with ``x <= y``, and may swap the arguments of ``x == y`` and ``x != y``. The ``sort()`` and ``min()`` operations are guaranteed to use the ``<`` operator and the ``max()`` function uses the ``>`` operator. However, it is best to implement all six operations so that confusion doesn't arise in other contexts.
ko: PEP 207은 파이썬이 가정하고 있는 재귀적 규칙에 대해 설명하고 있다. 이에 따르면, 인터프리터는 ``y > x``를 ``x < y``\ 으로, ``y >= x``\ 를 ``x <= y``\ 라는 코드로 변형해서 사용할 수 있으며, ``x == y``\ 와 ``x != y``\ 의 경우 두 인수의 위치를 서로 바꿀 수도 있다. ``sort()``\ 와 ``min()`` 명령은 ``<`` 연산자를 사용하며, ``max()`` 함수는 ``>`` 연산자를 사용한다. 어쨌든, 여섯 개의 연산을 모두 구현하여 다른 맥락에서 혼동이 일어나지 않도록 하는 것이 가장 좋다.

source: PEP Editor Responsibilities & Workflow ======================================
ko: PEP 편집자의 책임 및 흐름 =========================

source: PEP Editors -----------
ko: PEP 편집자 ----------

source: PEP Formats and Templates =========================
ko: PEP 형식 및 템플릿 ==================

source: PEP Header Preamble ===================
ko: PEP 헤더 ========

source: PEP Maintenance ---------------
ko: PEP 유지관리 ------------

source: PEP Replacement
ko: PEP 대체

source: PEP Review & Resolution -----------------------
ko: PEP 검토 및 해결 ----------------

source: PEP Types =========
ko: PEP의 종류 ==========

source: PEP Workflow ============
ko: PEP의 흐름 ==========

source: PEP authors are responsible for collecting community feedback on a PEP before submitting it for review. However, wherever possible, long open-ended discussions on public mailing lists should be avoided. Strategies to keep the discussions efficient include: setting up a separate SIG mailing list for the topic, having the PEP author accept private comments in the early design phases, setting up a wiki page, etc. PEP authors should use their discretion here.
ko: PEP 저자는 PEP를 검토를 위해 제출하기에 앞서 커뮤니티의 피드백을 수집하는 책임을 진다. 그러나, 공개된 메일링 리스트에서 끝없이 이어지는 논의는 가능한 피하도록 한다. 효율적인 논의를 위한 방법으로는 각 주제별로 SIG 메일링 리스트를 구성하거나, 초기 디자인 단계에서는 개인적인 조언을 얻거나, 위키 페이지를 구성하는 것 등이 있다. 이 부분은 PEP 저자의 재량에 맡긴다.

source: PEP authors with hg push privileges for the PEP repository can update the PEPs themselves by using "hg push" to submit their changes.
ko: PEP 저장소에 대하여 hg push 권한을 가진 PEP 저자는 "hg push"를 사용하여 PEP를 직접 수정할 수 있다.

source: PEP editors don't pass judgment on PEPs. They merely do the administrative & editorial part (which is generally a low volume task).
ko: PEP 편집자는 PEP에 대하여 심사하지 않는다. 그들은 단지 관리 및 편집 측면의 일을 수행한다(일반적으로 적은 분량의 업무이다).

source: PEP editorship is by invitation of the current editors. The address <peps@python.org> is a mailing list for contacting the PEP editors. All email related to PEP administration (such as requesting a PEP number or providing an updated version of a PEP for posting) should be sent to this address (no cross-posting please).
ko: PEP의 편집자는 현재 편집자의 초대를 통해 선임한다. <peps@python.org> 메일링 리스트를 통해 PEP 편집자에게 연락할 수 있다. PEP 관리와 관련한 모든 이메일 (PEP 번호 요청 및 변경된 버전)은 이 주소로 발송하여야 한다(중복으로 글을 올리지 말기 바란다).

source: PEP review and resolution may also occur on a list other than python-dev (for example, distutils-sig for packaging related PEPs that don't immediately affect the standard library). In this case, the "Discussions-To" heading in the PEP will identify the appropriate alternative list where discussion, review and pronouncement on the PEP will occur.
ko: PEP 검토 및 해결은 python-dev 이외의 곳에서 이루어질 수도 있다(예를 들어, 표준 라이브러리에 직접적인 영향을 미치지 않는, 패키징에 관련해서는 distutils-sig에서 이루어진다). 이 경우, "Discussions-To" 머리말이 논의와 검토, 공고가 이루어질 메일링 리스트를 식별한다.

source: PEP stands for Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. The PEP should provide a concise technical specification of the feature and a rationale for the feature.
ko: PEP는 파이썬 커뮤니티에 정보를 제공하거나, 새로운 기능이나 프로세스 또는 환경을 기술하는 설계 문서이다. PEP는 기능에 대한 간결한 기술 명세와 기능에 대한 이론적 근거를 제공해야 한다.

source: PEP: 1 Title: PEP Purpose and Guidelines Version: $Revision$ Last-Modified: $Date$ Author: Barry Warsaw, Jeremy Hylton, David Goodger, Nick Coghlan Status: Active Type: Process Content-Type: text/x-rst Created: 13-Jun-2000 Post-History: 21-Mar-2001, 29-Jul-2002, 03-May-2003, 05-May-2012, 07-Apr-2013
ko: PEP: 1 Title: PEP의 목적 및 안내 Version: $Revision$ Last-Modified: $Date$ Author: Barry Warsaw, Jeremy Hylton, David Goodger, Nick Coghlan Status: Active Type: Process Content-Type: text/x-rst Created: 13-Jun-2000 Post-History: 21-Mar-2001, 29-Jul-2002, 03-May-2003, 05-May-2012, 07-Apr-2013

source: PEP: 10 Title: Voting Guidelines Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Active Type: Process Created: 07-Mar-2002 Post-History: 07-Mar-2002
ko: PEP: 10 Title: 투표 안내 Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Active Type: Process Created: 07-Mar-2002 Post-History: 07-Mar-2002

source: PEP: 100 Title: Python Unicode Integration Version: $Revision$ Last-Modified: $Date$ Author: mal@lemburg.com (Marc-André Lemburg) Status: Final Type: Standards Track Created: 10-Mar-2000 Python-Version: 2.0 Post-History:
ko: PEP: 100 Title: Python 유니코드 통합 Version: $Revision$ Last-Modified: $Date$ Author: mal@lemburg.com (Marc-André Lemburg) Status: Final Type: Standards Track Created: 10-Mar-2000 Python-Version: 2.0 Post-History:

source: PEP: 101 Title: Doing Python Releases 101 Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw), guido@python.org (Guido van Rossum) Status: Active Type: Informational Created: 22-Aug-2001 Post-History:
ko: PEP: 101 Title: 파이썬 릴리스하기 101 Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw), guido@python.org (Guido van Rossum) Status: Active Type: Informational Created: 22-Aug-2001 Post-History:

source: PEP: 102 Title: Doing Python Micro Releases Version: $Revision$ Last-Modified: $Date$ Author: anthony@interlink.com.au (Anthony Baxter), barry@python.org (Barry Warsaw), guido@python.org (Guido van Rossum) Status: Superseded Type: Informational Created: 22-Aug-2001 (edited down on 9-Jan-2002 to become PEP 102) Post-History: Superseded-By: 101
ko: PEP: 102 Title: 파이썬 마이크로 릴리스하기 Version: $Revision$ Last-Modified: $Date$ Author: anthony@interlink.com.au (Anthony Baxter), barry@python.org (Barry Warsaw), guido@python.org (Guido van Rossum) Status: Superseded Type: Informational Created: 22-Aug-2001 (edited down on 9-Jan-2002 to become PEP 102) Post-History: Superseded-By: 101

source: PEP: 11 Title: Removing support for little used platforms Version: $Revision$ Last-Modified: $Date$ Author: martin@v.loewis.de (Martin von Löwis) Status: Active Type: Process Content-Type: text/x-rst Created: 07-Jul-2002 Post-History: 18-Aug-2007
ko: PEP: 11 Title: 잘 쓰이지 않는 플랫폼에 대한 지원 중단 Version: $Revision$ Last-Modified: $Date$ Author: martin@v.loewis.de (Martin von Löwis) Status: Active Type: Process Content-Type: text/x-rst Created: 07-Jul-2002 Post-History: 18-Aug-2007

source: PEP: 12 Title: Sample reStructuredText PEP Template Version: $Revision$ Last-Modified: $Date$ Author: David Goodger <goodger@python.org>, Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Aug-2002 Post-History: 30-Aug-2002
ko: PEP: 12 Title: reStructuredText PEP 템플릿 견본 Version: $Revision$ Last-Modified: $Date$ Author: David Goodger <goodger@python.org>, Barry Warsaw <barry@python.org> Status: Active Type: Process Content-Type: text/x-rst Created: 05-Aug-2002 Post-History: 30-Aug-2002

source: PEP: 160 Title: Python 1.6 Release Schedule Version: $Revision$ Last-Modified: $Date$ Author: Fred L. Drake, Jr. <fdrake@acm.org> Status: Final Type: Informational Created: 25-Jul-2000 Python-Version: 1.6 Post-History:
ko: PEP: 160 Title: 파이썬 1.6 릴리스 일정 Version: $Revision$ Last-Modified: $Date$ Author: Fred L. Drake, Jr. <fdrake@acm.org> Status: Final Type: Informational Created: 25-Jul-2000 Python-Version: 1.6 Post-History:

source: PEP: 2 Title: Procedure for Adding New Modules Version: $Revision$ Last-Modified: $Date$ Author: Martijn Faassen <faassen@infrae.com> Status: Final Type: Process Created: 07-Jul-2001 Post-History: 07-Jul-2001, 09-Mar-2002
ko: PEP: 2 Title: 새로운 모듈을 추가하는 절차 Version: $Revision$ Last-Modified: $Date$ Author: Martijn Faassen <faassen@infrae.com> Status: Final Type: Process Created: 07-Jul-2001 Post-History: 07-Jul-2001, 09-Mar-2002

source: PEP: 20 Title: The Zen of Python Version: $Revision$ Last-Modified: $Date$ Author: tim@zope.com (Tim Peters) Status: Active Type: Informational Content-Type: text/plain Created: 19-Aug-2004 Post-History: 22-Aug-2004
ko: PEP: 20 Title: 파이썬 선(禪) Version: $Revision$ Last-Modified: $Date$ Author: tim@zope.com (Tim Peters) Status: Active Type: Informational Content-Type: text/plain Created: 19-Aug-2004 Post-History: 22-Aug-2004

source: PEP: 200 Title: Python 2.0 Release Schedule Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Informational Created: Python-Version: 2.0 Post-History:
ko: PEP: 200 Title: 파이썬 2.0 릴리스 일정 Version: $Revision$ Last-Modified: $Date$ Author: Jeremy Hylton <jeremy@alum.mit.edu> Status: Final Type: Informational Created: Python-Version: 2.0 Post-History:

source: PEP: 201 Title: Lockstep Iteration Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History: 27-Jul-2000
ko: PEP: 201 Title: Lockstep 이터레이션 Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History: 27-Jul-2000

source: PEP: 202 Title: List Comprehensions Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History:
ko: PEP: 202 Title: 리스트 Comprehensions Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History:

source: PEP: 203 Title: Augmented Assignments Version: $Revision$ Last-Modified: $Date$ Author: thomas@python.org (Thomas Wouters) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History: 14-Aug-2000
ko: PEP: 203 Title: Augmented 할당 Version: $Revision$ Last-Modified: $Date$ Author: thomas@python.org (Thomas Wouters) Status: Final Type: Standards Track Created: 13-Jul-2000 Python-Version: 2.0 Post-History: 14-Aug-2000

source: PEP: 204 Title: Range Literals Version: $Revision$ Last-Modified: $Date$ Author: thomas@python.org (Thomas Wouters) Status: Rejected Type: Standards Track Created: 14-Jul-2000 Python-Version: 2.0 Post-History:
ko: PEP: 204 Title: Range 리터럴 Version: $Revision$ Last-Modified: $Date$ Author: thomas@python.org (Thomas Wouters) Status: Rejected Type: Standards Track Created: 14-Jul-2000 Python-Version: 2.0 Post-History:

source: PEP: 205 Title: Weak References Version: $Revision$ Last-Modified: $Date$ Author: Fred L. Drake, Jr. <fdrake@acm.org> Status: Final Type: Standards Track Created: Python-Version: 2.1 Post-History: 11-Jan-2001
ko: PEP: 205 Title: 약한 참조 Version: $Revision$ Last-Modified: $Date$ Author: Fred L. Drake, Jr. <fdrake@acm.org> Status: Final Type: Standards Track Created: Python-Version: 2.1 Post-History: 11-Jan-2001

source: PEP: 206 Title: Python Advanced Library Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Withdrawn Type: Informational Created: Post-History:
ko: PEP: 206 Title: Python 고급 라이브러리 Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Withdrawn Type: Informational Created: Post-History:

source: PEP: 209 Title: Multi-dimensional Arrays Version: $Revision$ Last-Modified: $Date$ Author: barrett@stsci.edu (Paul Barrett), oliphant@ee.byu.edu (Travis Oliphant) Status: Withdrawn Type: Standards Track Created: 03-Jan-2001 Python-Version: 2.2 Post-History:
ko: PEP: 209 Title: 다차원 배열 Version: $Revision$ Last-Modified: $Date$ Author: barrett@stsci.edu (Paul Barrett), oliphant@ee.byu.edu (Travis Oliphant) Status: Withdrawn Type: Standards Track Created: 03-Jan-2001 Python-Version: 2.2 Post-History:

source: PEP: 212 Title: Loop Counter Iteration Version: $Revision$ Last-Modified: $Date$ Author: nowonder@nowonder.de (Peter Schneider-Kamp) Status: Deferred Type: Standards Track Created: 22-Aug-2000 Python-Version: 2.1 Post-History:
ko: PEP: 212 Title: 루프 카운터 이터레이션 Version: $Revision$ Last-Modified: $Date$ Author: nowonder@nowonder.de (Peter Schneider-Kamp) Status: Deferred Type: Standards Track Created: 22-Aug-2000 Python-Version: 2.1 Post-History:

source: PEP: 213 Title: Attribute Access Handlers Version: $Revision$ Last-Modified: $Date$ Author: paul@prescod.net (Paul Prescod) Status: Deferred Type: Standards Track Created: 21-Jul-2000 Python-Version: 2.1 Post-History:
ko: PEP: 213 Title: 어트리뷰트 접근 핸들러 Version: $Revision$ Last-Modified: $Date$ Author: paul@prescod.net (Paul Prescod) Status: Deferred Type: Standards Track Created: 21-Jul-2000 Python-Version: 2.1 Post-History:

source: PEP: 214 Title: Extended Print Statement Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 24-Jul-2000 Python-Version: 2.0 Post-History: 16-Aug-2000
ko: PEP: 214 Title: Print 문 확장 Version: $Revision$ Last-Modified: $Date$ Author: barry@python.org (Barry Warsaw) Status: Final Type: Standards Track Created: 24-Jul-2000 Python-Version: 2.0 Post-History: 16-Aug-2000

source: PEP: 216 Title: Docstring Format Version: $Revision$ Last-Modified: $Date$ Author: moshez@zadka.site.co.il (Moshe Zadka) Status: Rejected Type: Informational Created: 31-Jul-2000 Post-History: Superseded-By: 287
ko: PEP: 216 Title: Docstring 형식 Version: $Revision$ Last-Modified: $Date$ Author: moshez@zadka.site.co.il (Moshe Zadka) Status: Rejected Type: Informational Created: 31-Jul-2000 Post-History: Superseded-By: 287

source: PEP: 217 Title: Display Hook for Interactive Use Version: $Revision$ Last-Modified: $Date$ Author: moshez@zadka.site.co.il (Moshe Zadka) Status: Final Type: Standards Track Created: 31-Jul-2000 Python-Version: 2.1 Post-History:
ko: PEP: 217 Title: 대화식 사용을 위한 Display Hook Version: $Revision$ Last-Modified: $Date$ Author: moshez@zadka.site.co.il (Moshe Zadka) Status: Final Type: Standards Track Created: 31-Jul-2000 Python-Version: 2.1 Post-History:

source: PEP: 218 Title: Adding a Built-In Set Object Type Version: $Revision$ Last-Modified: $Date$ Author: gvwilson@ddj.com (Greg Wilson), python@rcn.com (Raymond Hettinger) Status: Final Type: Standards Track Created: 31-Jul-2000 Python-Version: 2.2 Post-History:
ko: PEP: 218 Title: 빌트인 Set 개체 유형의 추가 Version: $Revision$ Last-Modified: $Date$ Author: gvwilson@ddj.com (Greg Wilson), python@rcn.com (Raymond Hettinger) Status: Final Type: Standards Track Created: 31-Jul-2000 Python-Version: 2.2 Post-History:

source: PEP: 219 Title: Stackless Python Version: $Revision$ Last-Modified: $Date$ Author: gmcm@hypernet.com (Gordon McMillan) Status: Deferred Type: Standards Track Created: 14-Aug-2000 Python-Version: 2.1 Post-History:
ko: PEP: 219 Title: 스택리스 파이썬 Version: $Revision$ Last-Modified: $Date$ Author: gmcm@hypernet.com (Gordon McMillan) Status: Deferred Type: Standards Track Created: 14-Aug-2000 Python-Version: 2.1 Post-History:

source: PEP: 222 Title: Web Library Enhancements Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Deferred Type: Standards Track Created: 18-Aug-2000 Python-Version: 2.1 Post-History: 22-Dec-2000
ko: PEP: 222 Title: 웹 라이브러리 개선 Version: $Revision$ Last-Modified: $Date$ Author: A.M. Kuchling <amk@amk.ca> Status: Deferred Type: Standards Track Created: 18-Aug-2000 Python-Version: 2.1 Post-History: 22-Dec-2000

source: PEP: 223 Title: Change the Meaning of \x Escapes Version: $Revision$ Last-Modified: $Date$ Author: tim@zope.com (Tim Peters) Status: Final Type: Standards Track Created: 20-Aug-2000 Python-Version: 2.0 Post-History: 23-Aug-2000
ko: PEP: 223 Title: \x 이스케이프의 의미 변경 Version: $Revision$ Last-Modified: $Date$ Author: tim@zope.com (Tim Peters) Status: Final Type: Standards Track Created: 20-Aug-2000 Python-Version: 2.0 Post-History: 23-Aug-2000

source: PEP: 224 Title: Attribute Docstrings Version: $Revision$ Last-Modified: $Date$ Author: mal@lemburg.com (Marc-André Lemburg) Status: Rejected Type: Standards Track Created: 23-Aug-2000 Python-Version: 2.1 Post-History:
ko: PEP: 224 Title: 어트리뷰트 Docstrings Version: $Revision$ Last-Modified: $Date$ Author: mal@lemburg.com (Marc-André Lemburg) Status: Rejected Type: Standards Track Created: 23-Aug-2000 Python-Version: 2.1 Post-History:
